{
  "products": [
    {
      "id": 1,
      "title": "Bluetooth Banana Phone",
      "price": "40.00",
      "quantity": "7",
      "image": "./img/banana-phone.png",
      "description": "Add slapstick style to your phone with this handset worthy of a Marx Brothers gag. It connects through Bluetooth for wireless conversations that keep phone radiation away from your coconut. Just pair it with your device to receive calls and use your favorite voice assistant (like Siri) to make them. Talk for up to 10 hours with the USB-rechargeable battery and know you're helping keep the jungle green thanks to the 100% recycled plastic cover. Made in China."
    },
    {
      "id": 2,
      "title": "Lovebox Spinning Heart Messenger",
      "price": "100.00",
      "quantity": "19",
      "image": "./img/heart-box.png",
      "description": "Send heartfelt messages to loved ones—anytime, anywhere in the world—with this modern take on the classic love note. When you send a new message through the easy-to-use app, the chunky heart on the beechwood box spins to alert the recipient. Then, the object of your affection opens the box to read the sentiment on the mirrored screen inside. They can return the virtual embrace by spinning the heart to send a shower of digital hearts to the sender's screen."
    },
    {
      "id": 3,
      "title": "Gourd Amplifier",
      "price": "100.00",
      "quantity": "11",
      "image": "./img/gourd-amp.png",
      "description": "This is no garden variety amplifier. Sure, it has the workings of a standard, volume-boosting speaker, but instead of a standard plastic or metal casting, they are housed within a hollow gourd. The curvaceous shape and vibrant color transform a functional object into a playful, eye-catching work of art. The amplifier is powered by a single 9V battery, and an LED light lets you know when power is on. Handmade by Paul and Sue Bergstrom in Blairsville, Georgia."
    }
  ],
  "authors": [
    {
      "id": 1,
      "name": "Ming Wang"
    },
    {
      "id": 2,
      "name": "Wong Wang"
    },
    {
      "id": 3,
      "name": "Fang Wang"
    }
  ],
  "reviews": [
    {
      "productId": 1,
      "authorId": 1,
      "id": 1,
      "rating": 5,
      "title": "Clean Banana for Dirty Santa",
      "body": "Even though I originally bought this as a dirty santa gift, I wanted it for myself. As a high school teacher you have to get the kids attention somehow. What better way than with a Banana Phone?!"
    },
    {
      "productId": 1,
      "authorId": 2,
      "id": 2,
      "rating": 4,
      "title": "No One Has This Yet",
      "body": "My brother needs nothing and has everything... except a banana phone! He's been using it at work and has been asked by multiple coworkers where he got it so they can get one too."
    },
    {
      "productId": 1,
      "authorId": 3,
      "id": 3,
      "rating": 4.5,
      "title": "Smello?",
      "body": "My husband put the banana phone to use immediately and everyone in our family has used it. It may seem a little pricey but it's just one of those gifts that are fun and always make you smile. That smile is worth the money."
    },
    {
      "productId": 2,
      "authorId": 3,
      "id": 4,
      "rating": 5,
      "title": "Happy Heart, Happy Life",
      "body": "This product was everything that I had wished for! Easy plug and play! So differently adorable! Makes for a happy wife!"
    },
    {
      "productId": 2,
      "authorId": 2,
      "id": 5,
      "rating": 3.5,
      "title": "Goodnight My Love",
      "body": "My daughter has the love box in her room at her fathers house. It's perfect to send little thoughtful messages before bed or before school."
    },
    {
      "productId": 2,
      "authorId": 1,
      "id": 6,
      "rating": 4,
      "title": "Love for Distant Relatives",
      "body": "I gave it to my grandmother so we could send her sweet messages to make her smile even though she isn't tech savvy."
    },
    {
      "productId": 3,
      "authorId": 1,
      "id": 7,
      "rating": 4.5,
      "title": "A Pretty Gourd Time",
      "body": "I was given one of these as a gift from a friend. Its a very unique design and I am already finding it quite useful. It sounds pretty good for a gourd!!"
    },
    {
      "productId": 3,
      "authorId": 3,
      "id": 8,
      "rating": 4,
      "title": "Food Lover's Favorite Music",
      "body": "I ordered this product for my sister as a birthday present. She's a guitarist and a music lover, so I knew it would be fun and useful. I couldn't help but try it out when it arrived! It's so beautiful!"
    },
    {
      "productId": 3,
      "authorId": 2,
      "id": 9,
      "rating": 5,
      "title": "Garden Variety Amp",
      "body": "I love thats it's handmade. It's a great conversation piece! I love that it is so pretty and unique, and serves a functional purpose as well."
    }
  ]
}